In [5]:
import numpy as np
import pandas as pd
from sklearn import tree

In [17]:
input_file="./datasets/PastHires.csv"

In [18]:
input_file

'./datasets/PastHires.csv'

In [19]:
df=pd.read_csv(input_file,header=0)

In [20]:
df.head()

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,Y,4,BS,N,N,Y
1,0,N,0,BS,Y,Y,Y
2,7,N,6,BS,N,N,N
3,2,Y,1,MS,Y,N,Y
4,20,N,2,PhD,Y,N,N

## Changing non numbers to number for scikit learn(it only takes numbers)

In [21]:
d={'Y':1,"N":0}
df['Hired']=df['Hired'].map(d)

In [22]:
df["Hired"]

0     1
1     1
2     0
3     1
4     0
5     1
6     1
7     1
8     1
9     0
10    0
11    1
12    1
Name: Hired, dtype: int64

In [24]:
df['Employed?']=df['Employed?'].map(d)
df["Top-tier school"]=df['Top-tier school'].map(d)
df['Interned']=df['Interned'].map(d)

In [25]:
d={'BS':1,"MS":2,"PhD":3}
df['Level of Education']=df['Level of Education'].map(d)

In [27]:
df

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,1,4,1,0,0,1
1,0,0,0,1,1,1,1
2,7,0,6,1,0,0,0
3,2,1,1,2,1,0,1
4,20,0,2,3,1,0,0
5,0,0,0,3,1,1,1
6,5,1,2,2,0,1,1
7,3,0,1,1,0,1,1
8,15,1,5,1,0,0,1
9,0,0,0,1,0,0,0
10,1,0,1,3,1,0,0
11,4,1,1,1,0,1,1
12,0,0,0,3,1,0,1